tap "felixkratz/formulae"
tap "homebrew-zathura/zathura"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "koekeishiya/formulae"
brew "harfbuzz"
brew "btop"
brew "cmake"
brew "diff-pdf"
brew "docker"
brew "fastfetch"
brew "fastlane"
brew "python@3.12"
brew "ffmpeg"
brew "git"
brew "httpd"
brew "jq"
brew "kdoctor"
brew "llvm"
brew "neovim"
brew "nvm"
brew "openjdk"
brew "postgresql@14", restart_service: :changed
brew "protobuf"
brew "pyenv"
brew "ruby-build"
brew "rbenv"
brew "rust"
brew "stow"
brew "swiftformat"
brew "tmux"
brew "wget"
brew "homebrew-zathura/zathura/zathura"
brew "homebrew-zathura/zathura/zathura-pdf-mupdf"
cask "font-hack-nerd-font"
cask "github-copilot-for-xcode"
cask "keepassxc"
cask "pgadmin4"
vscode "anysphere.csharp"
vscode "anysphere.cursorpyright"
vscode "anysphere.remote-containers"
vscode "geequlim.godot-tools"
vscode "ionide.ionide-fsharp"
vscode "kreativ-software.csharpextensions"
vscode "mathiasfrohlich.kotlin"
vscode "ms-azuretools.vscode-containers"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.dotnet-interactive-vscode"
vscode "ms-dotnettools.vscode-dotnet-pack"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.mono-debug"
vscode "ms-vscode.theme-tomorrowkit"
vscode "muhammad-sammy.csharp"
vscode "neikeq.godot-csharp-vscode"
vscode "redhat.java"
vscode "twxs.cmake"
vscode "vscjava.vscode-gradle"
vscode "vscodevim.vim"
vscode "woberg.godot-dotnet-tools"
